{
  "base_model_name_or_path": "bigcode/starcoder",
  "bias": "none",
  "enable_lora": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "merge_weights": false,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "target_modules": [
    "c_attn",
    "c_proj"
  ],
  "task_type": "CAUSAL_LM"
}